app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "sfsffsfs"], ["content", "fsfsfsfsfafsa"], ["created_at", "2024-02-14 10:34:07.958158"], ["updated_at", "2024-02-14 10:34:07.958158"]]
---
    def create
        @post = Post.new(post_params)
        if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "first updated post"], ["content", "hello from first updated post\r\n"], ["updated_at", "2024-02-16 05:40:05.666742"], ["id", 4]]
---
    def update
        @post =Post.find(params[:id])
        if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
    def destroy
        #puts "deleted----------------------------------"
        @post = Post.find(params[:id])
        @post.destroy